# -*- coding: utf-8 -*-
"""pydp-27_PETROV_I_A.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1VBTumMblibzbeK1jg5LZeveFfoy3w6Oz

#Петров Игорь (pydp-27)

##ДЗ "Основы Python"

### Задание 1
"""

#Задание 1
#1.1
print ("#1.1")
fr1="Джеймс Бонд - Агент 007"
fr2="Мстители:Война Бесконечности"
l_fr1=len(fr1)
l_fr2=len(fr2)

if (l_fr1>l_fr2):
  print ("Фильм ",fr1, "интереснее чем ", fr2)
elif (l_fr1==l_fr2):
  print ("Фильмы ",fr1,fr2, " одинаково интересны")
else:
  print ("Фильм ",fr2, "интереснее чем ", fr1)

#1.2
print ("#1.2")
fr1="Пираты карибского моря"
fr2="Человек паук"
l_fr1=len(fr1)
l_fr2=len(fr2)

if (l_fr1>l_fr2):
  print ("Фильм ",fr1, "интереснее чем ", fr2)
elif (l_fr1==l_fr2):
  print ("Фильмы ",fr1,fr2, " одинаково интересны")
else:
  print ("Фильм ",fr2, "интереснее чем ", fr1)

#1.3
print ("#1.3")
fr1="Крепкий орешек 1"
fr2="Крепкий орешек 2"
l_fr1=len(fr1)
l_fr2=len(fr2)

if (l_fr1>l_fr2):
  print ("Фильм ",fr1, "интереснее чем ", fr2)
elif (l_fr1==l_fr2):
  print ("Фильмы ",fr1,fr2, " одинаково интересны")
else:
  print ("Фильм ",fr2, "интереснее чем ", fr1)

"""###Задание 2"""

#Задание 2
#год является високосным, если его номер кратен 4, но не кратен 100, а также если он кратен 400
#2.1
print ("#2.1")
year=2000
print(((year%4==0 and year%100!=0) or year%400==0))
if ((year%4==0 and year%100!=0) or year%400==0):
  print ("Год",year,"- високостный")
else:
  print ("Год",year,"- не високостный")

#2.2 

print ("#2.2")
year=2021
if ((year%4==0 and year%100!=0) or year%400==0):
  print ("Год",year,"- високостный")
else:
  print ("Год",year,"- не високостный")

"""###Задание 3"""

#Задание 3
date=int(input("Введите день рождения:"))
if (date<1 or date>31):
  print("Такого дня недели не существует!")

month=str(input("Введите месяц рождения:"))

if (month=='январь' or month=='Январь' or month=='ЯНВАРЬ'):
  month_num=1
elif (month=='февраль' or month=='Февраль' or month=='ФЕВРАЛЬ'):
  month_num=2
elif (month=='март' or month=='Март' or month=='МАРТ'):
  month_num=3
elif (month=='апрель' or month=='Апрель' or month=='АПРЕЛЬ'):
  month_num=4
elif (month=='май' or month=='Май' or month=='МАЙ'):
  month_num=5
elif (month=='июнь' or month=='Июнь' or month=='ИЮНЬ'):
  month_num=6
elif (month=='июль' or month=='Июль' or month=='ИЮЛЬ'):
  month_num=7
elif (month=='август' or month=='Август' or month=='АВГУСТ'):
  month_num=8
elif (month=='сентябрь' or month=='Сентябрь' or month=='СЕНТЯБРЬ'):
  month_num=9
elif (month=='октябрь' or month=='Октябрь' or month=='ОКТЯБРЬ'):
  month_num=10
elif (month=='ноябрь' or month=='Ноябрь' or month=='НОЯБРЬ'):
  month_num=11
elif (month=='декабрь' or month=='Декабрь' or month=='ДЕКАБРЬ'):
  month_num=12
else:
  month_num=0
  print("Такого месяца не существует!")


if ((date>=21 and month_num==1) or (date<=18 and month_num==2)):
  print("Ваш знак зодиака Водолей")
elif ((date>=20 and month_num==2) or (date<=20 and month_num==3)):
  print("Ваш знак зодиака Рыбы")
elif ((date>=21 and month_num==3) or (date<=20 and month_num==4)):
  print("Ваш знак зодиака Овен")
elif ((date>=21 and month_num==4) or (date<=21 and month_num==5)):
  print("Ваш знак зодиака Телец")
elif ((date>=22 and month_num==5) or (date<=21 and month_num==6)):
  print("Ваш знак зодиака Близнецы")
elif ((date>=22 and month_num==6) or (date<=22 and month_num==7)):
  print("Ваш знак зодиака Рак")
elif ((date>=23 and month_num==7) or (date<=21 and month_num==8)):
  print("Ваш знак зодиака Лев")
elif ((date>=22 and month_num==8) or (date<=23 and month_num==9)):
  print("Ваш знак зодиака Дева")
elif ((date>=24 and month_num==9) or (date<=23 and month_num==10)):
  print("Ваш знак зодиака Весы")
elif ((date>=24 and month_num==10) or (date<=22 and month_num==11)):
  print("Ваш знак зодиака Скорпион")
elif ((date>=23 and month_num==11) or (date<=22 and month_num==12)):
  print("Ваш знак зодиака Стрелец")
elif ((date>=23 and month_num==12) or (date<=20 and month_num==1)):
  print("Ваш знак зодиака Козерог")
else:
  print("Неизвестная дата!")

"""###Задание 4"""

#Задание 4
width=int(input("Введите ширину:"))
lenght=int(input("Введите длину:"))
heigh=int(input("Введите высота:"))


if (lenght<=15 and width<=15 and heigh<=15):
  print ("Коробка №1")
elif ((lenght>15 and lenght<50) or (width>15 and width<50) or (heigh>15 and heigh<50)):
  print ("Коробка №2")
elif (lenght>200):
  print ("Упаковка для лыж")
else:
  print ("Стандартная коробка №3")

"""###Задание 5"""

#Задание 5
num=int(input("Введите 6зн число:"))
#
n1=int(num/1000)
n11=int(n1/100)
n12=int(n1/10)
n12=int(n12%10)
n13=int(n1%10)
n1_sum=n11+n12+n13
#
n2=int(num%1000)
n21=int(n2/100)
n22=int(n2/10)
n22=int(n22%10)
n23=int(n2%10)
n2_sum=n21+n22+n23
#
if(n1_sum==n2_sum):
  print("Счастливое число")
else:
  print("Не счастливое число")