# -*- coding: utf-8 -*-
"""pydp-27_PETROV_I_A_dz4.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1uj_jDm0LuGBG1NRWXKDRb-6jBpTcFZ93

#Петров Игорь (pydp-27)

##ДЗ 04 "Функции"

### Задание 1, 2
"""

#Задание 1, 2
#документы
documents = [
{'type': 'passport', 'number': '2207 876234', 'name': 'Василий Гупкин'},
{'type': 'invoice', 'number': '11-2', 'name': 'Геннадий Покемонов'},
{'type': 'insurance', 'number': '10006', 'name': 'Аристарх Павлов'}
]
#полки
directories = {
'1': ['2207 876234', '11-2'],
'2': ['10006'],
'3': []
}

def menu():
  query = ''
  while(query != 'q'):
    query = input('Введите запрос:')

    if(query in ('p','s','d')): 
      nDoc = input('Введите номер документа:')
      cmDocs(documents, query, 'res', nDoc)

    elif(query in ('l', 'ld')): 
      cmDocs(documents, query, 'res')
      
    elif(query in ('ads', 'ds')): 
      nDoc = int(input('Введите номер полки:'))
      cmDocs(documents, query, 'res', nDoc)
    
    elif(query == 'ad'):
       nDoc = input('Введите номер документа:')
       tDoc = input('Введите тип документа:')
       sDoc = input('Введите владельца документа:')
       nStr = int(input('Введите полку для хранения:'))
       cmDocs(documents, query, 'res', nDoc, tDoc, sDoc, nStr) #params={'tDoc':tDoc, 'sDoc':sDoc, 'nStr':nStr}
       
    elif(query in ('m')): 
      nDoc = input('Введите номер документа:')
      nStr = int(input('Введите номер полки:'))
      cmDocs(documents, query, 'res', nDoc=nDoc, nStr=nStr)

    elif(query == 'q'):
      print('Конец программы')
      break

    else: print("Такой команды нет")

 # return query

def cmDocs(documents=documents, qType='', oType='res', nDoc='', tDoc='', sDoc='', nStr=''):
  """ qType:
  p - получить владельца док-та по номеру 
  s - получить № полки документа
  l - получить инф-ию по всем документам
  ads - добавление полки
  ds  - удаление пустой полки
  ad  - добавление документа
  ld - получить инф-ию по всем полкам
  d  - удалить документ
  m  - переместить док-нт по полкам"""
 
  res = ''
  if(qType in ('p', 'd')):    #1.1, #2.2
    for docs in documents:
      for key, value in docs.items():
        if(qType == 'p' and value == nDoc): 
          res = docs.get('name')
        elif(qType == 'd' and value == nDoc):
          documents.remove(docs)
          [value2.remove(nDoc) for key2, value2 in directories.items() if nDoc in value2]
          res = 'Документ удален.'
    
  elif(qType == 's'):   #1.2
    for key, value in directories.items():
      for i in value:
        if(i == nDoc and oType=='res'): res = key
        elif(i == nDoc and oType == 'dat'): return key
        
  elif(qType == 'l'):    #1.3
    for docs in documents:
      print('№:%s, тип:%s, владелец:%s, полка хранения:%s' % (docs.get('number'), docs.get('type'), docs.get('name'), cmDocs(qType='s', oType='dat', nDoc=docs.get('number'))))

  elif(qType == 'ads'):  #1.4
      if str(nDoc) in directories: 
        res = 'Такая полка уже существует.'
      else:
        directories[nDoc] = []
        res = 'Полка добавлена.'
  
  elif(qType == 'ds'):   #1.5
      if str(nDoc) not in directories:
        res = 'Такой полки не существует.'
      #print(len(directories.get(nDoc)))
      elif len(directories.get(str(nDoc))) == 0:
        del directories[str(nDoc)]
        res = 'Полка удалена.'
      else: res = 'На полке есть документы, удалите их перед удалением полки.'
      
  elif(qType == 'ad'):   #2.1
      if str(nStr) not in directories:
        res = 'Такой полки не существует. Добавьте полку командой as.'
      else:
        documents.append({'type': tDoc, 'number': nDoc, 'name': sDoc}) 
        [value.append(nDoc) for key, value in directories.items() if str(nStr) == key]
        res = 'Документ добавлен.'

  elif (qType == 'm'):   #2.3
      if str(nStr) not in directories:
        res = 'Такой полки не существует.'
        qType = 'm1'
      else:
        for key, value in directories.items():
          if nDoc in value:
            value.remove(nDoc)
            [value.append(nDoc) for key, value in directories.items() if str(nStr) == key]
            res = 'Документ перемещен.'
          
  elif(qType == 'ld'):   #extend
      res = 'Текущее содержание полок:'

  if(oType == 'res'):
    if(len(res)>0):
      if(qType == 'p'): print('Владелец документа:', res)
      if(qType == 's'): print('Документ хранится на полке:', res)
      if(qType in ('ads','ds','m1')): 
        res = res + 'Текущий перечень полок: ' + str(sorted(directories.keys())).lstrip('[').rstrip(']')
        print(res) 
      if(qType == 'ad'): 
        print(res) 
        cmDocs(qType='l', oType='res')
      if(qType in ('d','m')): 
        print(res)
        cmDocs(qType='l', oType='res')
      if(qType == 'ld'): print(res, str((directories)).lstrip('{').rstrip('}'))
    elif((qType not in('l','ld')) and (len(res) == 0 or res=='')): print('Документ не найден в БД')

  #return

menu()